<!-- add-pr-comment:add-pr-comment -->

## Terraform dsd iam plan
```
Acquiring state lock. This may take a few moments...
data.aws_iam_policy.dsd_route53_read_role_policy: Reading...
aws_iam_policy.octodns_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/OctoDNSPolicy]
aws_iam_policy.secrets_manager_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/operations_engineering_test_secrets_manager_policy]
data.aws_iam_openid_connect_provider.github: Reading...
aws_iam_policy.assume_cloud_platform_route53_read_role_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/AssumeCloudPlatformRoute53ReadRolePolicy]
aws_iam_user.octodns_user: Refreshing state... [id=octodns-cicd-user]
aws_iam_policy.github_dormant_user_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/DormantUserS3Access]
aws_iam_access_key.octodns_access_key: Refreshing state... [id=AKIA42CZXXJSLENF66FF]
data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::880656497252:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.github_actions_assume_role_policy_document: Reading...
data.aws_iam_policy_document.github_actions_assume_role_policy_document: Read complete after 0s [id=2998923252]
aws_iam_role.assume_cloud_platform_route53_read_role: Refreshing state... [id=assume_cloud_platform_route53_read_role]
aws_iam_role.github_dormant_user_role: Refreshing state... [id=github_dormant_user_role]
aws_iam_role.dsd_route53_read_role: Refreshing state... [id=dsd_route53_read_role]
aws_iam_role.secrets_manager_role: Refreshing state... [id=operations_engineering_test_secrets_manager_role]
github_actions_secret.octodns_aws_secret_access_key: Refreshing state... [id=dns:OCTODNS_AWS_SECRET_ACCESS_KEY]
github_actions_secret.octodns_aws_access_key_id: Refreshing state... [id=dns:OCTODNS_AWS_ACCESS_KEY_ID]
aws_iam_user_policy_attachment.octodns_user_policy_attachment: Refreshing state... [id=octodns-cicd-user-20240625094312639400000001]
data.aws_iam_policy.dsd_route53_read_role_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonRoute53ReadOnlyAccess]
github_actions_secret.assume_cloud_platform_route53_read_role_arn: Refreshing state... [id=operations-engineering:ASSUME_CLOUD_PLATFORM_ROUTE53_READ_ROLE_ARN]
github_actions_secret.secrets_manager_role_arn: Refreshing state... [id=operations-engineering:AWS_SECRETS_MANAGER_ROLE_ARN]
aws_iam_role_policy_attachment.assume_cloud_platform_route53_read_role_policy_attatchment: Refreshing state... [id=assume_cloud_platform_route53_read_role-20240711162753928000000001]
aws_iam_role_policy_attachment.secrets_manager_attachment: Refreshing state... [id=operations_engineering_test_secrets_manager_role-20240711143120224500000001]
github_actions_secret.aws_role_arn: Refreshing state... [id=operations-engineering:GH_DORMANT_USER_AWS_ROLE_ARN]
aws_iam_role_policy_attachment.role_policy_attachment: Refreshing state... [id=github_dormant_user_role-20240422144734306600000001]
github_actions_secret.dsd_route53_read_role_arn: Refreshing state... [id=operations-engineering:DSD_ROUTE53_READ_ROLE_ARN]
aws_iam_role_policy_attachment.dsd_route53_read_role_policy_attatchment: Refreshing state... [id=dsd_route53_read_role-20240719154156458600000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.dns_check_change_status_policy will be created
  + resource "aws_iam_policy" "dns_check_change_status_policy" {
      + arn         = (known after apply)
      + description = "Policy to enable DNS Check Change Status"
      + id          = (known after apply)
      + name        = "DnsCheckChangeStatusPolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:ListHostedZonesByName",
                          + "route53:ListResourceRecordSets",
                          + "cloudtrail:LookupEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.assume_cloud_platform_route53_read_role will be updated in-place
  ~ resource "aws_iam_role" "assume_cloud_platform_route53_read_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:ministryofjustice/operations-engineering:*" -> [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/dns:*",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "assume_cloud_platform_route53_read_role"
        name                  = "assume_cloud_platform_route53_read_role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.dns_check_change_status_user_role will be created
  + resource "aws_iam_role" "dns_check_change_status_user_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/dns:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::880656497252:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dns_check_change_status_user_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.dsd_route53_read_role will be updated in-place
  ~ resource "aws_iam_role" "dsd_route53_read_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:ministryofjustice/operations-engineering:*" -> [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/dns:*",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "dsd_route53_read_role"
        name                  = "dsd_route53_read_role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.github_dormant_user_role will be updated in-place
  ~ resource "aws_iam_role" "github_dormant_user_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:ministryofjustice/operations-engineering:*" -> [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/dns:*",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "github_dormant_user_role"
        name                  = "github_dormant_user_role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.secrets_manager_role will be updated in-place
  ~ resource "aws_iam_role" "secrets_manager_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:ministryofjustice/operations-engineering:*" -> [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/dns:*",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "operations_engineering_test_secrets_manager_role"
        name                  = "operations_engineering_test_secrets_manager_role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.dns_check_change_status_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "dns_check_change_status_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dns_check_change_status_user_role"
    }

  # github_actions_secret.dns_check_change_status_aws_role_arn will be created
  + resource "github_actions_secret" "dns_check_change_status_aws_role_arn" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dns"
      + secret_name     = "DNS_CHECK_CHANGE_STATUS_AWS_ROLE_ARN"
      + updated_at      = (known after apply)
    }

Plan: 4 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```